# Indexing & Selection & Filtering in Pandas

In [2]:
import pandas as pd
import numpy as np

In [6]:
obj=pd.Series(np.arange(0,10,2),
              index=["a","b","c","d","e"])

In [7]:
obj

a    0
b    2
c    4
d    6
e    8
dtype: int32

In [8]:
# Selecting the Object in Index c 
obj["c"]

4

In [10]:
# Get object by Position
obj[2]

C:\Users\nisha\AppData\Local\Temp\ipykernel_11368\220162272.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[2]

4

In [12]:
# selecting object in Position 0 to 2
obj[0:3]

a    0
b    2
c    4
dtype: int32

In [14]:
# Selecting object in Index a,c
obj[["a","c"]]

a    0
c    4
dtype: int32

In [16]:
# Selecting the values of 0 and 2 position
obj[[0,2]]

C:\Users\nisha\AppData\Local\Temp\ipykernel_11368\1110525064.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[0,2]]

a    0
c    4
dtype: int32

In [9]:
obj[obj<2]

a    0
b    1
dtype: int32

In [10]:
obj["a":"c"]

a    0
b    1
c    2
dtype: int32

In [11]:
obj["b":"c"]=5
obj

a    0
b    5
c    5
d    3
e    4
dtype: int32

## DataFrame Indexing

In [35]:
data=pd.DataFrame(
    np.arange(16).reshape(4,4),
    index=["London","Paris",
           "Berlin","Istanbul"],
    columns=["one","two","three","four"])
data

          one  two  three  four
London      0    1      2     3
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [22]:
# To populate column Named two
data["two"]

London       1
Paris        5
Berlin       9
Istanbul    13
Name: two, dtype: int32

In [23]:
# To populate column Named two and One
data[["one","two"]]

          one  two
London      0    1
Paris       4    5
Berlin      8    9
Istanbul   12   13

In [24]:
# to print first two records
data[:2]

        one  two  three  four
London    0    1      2     3
Paris     4    5      6     7

In [29]:
# filtering the column four where value greater than 11
data[data["four"]>11]

          one  two  three  four
Istanbul   12   13     14    15

In [32]:
# If value of data greater than 14 replace 14
data[data['four']>13]=0
data

          one  two  three  four
London      0    0      0     0
Paris       0    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14     0

## Selecting with iloc and loc

In [37]:
# to print nth row
data.iloc[1]

one      4
two      5
three    6
four     7
Name: Paris, dtype: int32

In [40]:
data.iloc[1,[0,1,2]]

one      4
two      5
three    6
Name: Paris, dtype: int32

In [20]:
data.iloc[[1,3],[1,2,3]]

          two  three  four
Paris       5      6     7
Istanbul   13     14    15

In [21]:
data.loc["Paris",["one","two"]]

one    0
two    5
Name: Paris, dtype: int32

In [22]:
data.loc[:"Paris","four"]

London    0
Paris     7
Name: four, dtype: int32

In [23]:
toy_data=pd.Series(np.arange(5),
                   index=["a","b","c",
                          "d","e"])
toy_data

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [24]:
toy_data[-1]

4